#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 1912                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: ro1864 <boj.kr/u/ro1864>                    +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/1912                           #+#        #+#      #+#     #
#    Solved: 2024/05/30 11:57:40 by ro1864        ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
'''
(n+1) = (n-1) + n if (n+1)이 음수가 되지 않을 경우
(n+1) = n if (n+1)이 음수가 될 경우
'''

import sys
input = sys.stdin.readline

n = int(input())
p = list(map(int, input().split()))

dp = [0] * n
dp[0] = p[0]
for i in range(1, n):
    dp[i] = max(dp[i-1] + p[i], p[i])
print(max(dp))